:PROPERTIES:
:ID:       8c4cd16e-6661-432d-a681-7dfbd5bcc62a
:END:
#+title: numpy

Prise de note de numpy

Numpy tranforme des list en des np.narray().

** Les operateurs de comparaisons

les arrays de numpy doivent utiliser des fonctions particulière pour retourner une list de booléens dans le cas d'and, or ou not:
- logical_and()
- logical_or()
- logical_not()

** Loops

La fonction ~nditer()~ va faire une itération sur tout les éléments de la liste.

#+begin_src python :results output
import numpy as np
H = np.array([1.7, 1.85])
P = np.array([75 , 90])
dude = np.array([H, P])
for val in np.nditer(dude) :
    print(val)
#+end_src

#+RESULTS:
: 1.7
: 1.85
: 75.0
: 90.0
